<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication Language Lines
    |--------------------------------------------------------------------------
    |    |
    |
    |
    |

    | The following language lines are used during authentication for various
    | messages that we need to display to the user. You are free to modify
    | these language lines according to your application's requirements.
    |
    */
    'home' => 'الرئيسية',
 'employee' => 'موظف',
      'app-name' => 'BC Octopus Tasks Manager',
      'dashboard' => 'لوحة التحكم',
    'departments' => 'الأقسام',
    'task_creation' => 'مهمة جديدة',
'start_task_here_placeholder' => 'إبدأ بإضافة مهمة جديدة من هنا...',
'search_task_here_placeholder' => 'ابحث عن مهمة محددة من هنا...',
   'permissions' => 'السماحيات',

        'manage-departments' => 'إدارة الأقسام ضمن الشركة',
    'manage-users' => 'إدارة المستخدمين ضمن الشركة',
    'assign-users-department' => 'تغيير القسم الذي ينتمي اليه الموظف',
    'manage-department-tasks' => 'إدارة المهام ضمن الشركة',
    'manage-his-department-tasks' => 'إدارة المهام ضمن القسم',
    'manage-his-department-users' => 'إدارة المستخدمين ضمن القسم',

    'role' => 'نوع المستخدم',
    'no-roles' => 'لم يتم تحديد نوع للمستخدم',
       'manage-permissions' => 'إدارة الصلاحيات والسماحيات للمستخدمين',

      'delete_task' => 'حذف المهمة',
      'to_to' => 'لاحقاً',
      'in_prog' => 'جاري العمل',
      'done' => 'تم',
  'not_assigned' => 'لم يتم اسنادها',
        'plz_wait' => 'يرجى الانتظار..',
      'loading_data' => 'جاري التحميل',
        'title' => 'العنوان',
      'close' => 'إغلاق',
      'submit' => 'حفظ',
      'image' => 'صورة',
      'evaluation' => 'التقييم',
      'evaluations' => 'التقييمات',

      'starts_at' => 'توقيت البدء',
      'ends_at' => 'توقيت الانتهاء',
      'save_task_timing' => 'حفظ التوقيت',
     'user-assigned-tasks' => 'مهماتي الحالية',
     'department-tasks' => 'مهام القسم',
     'tasks-done' => 'المهام المنجزة',
     'profile' => 'الملف الشخصي',


     'hours' => 'ساعة',
      'duration_not_set' => 'لم يتم تحديد المدة الزمنية',
      'perc_of_day' => 'من ساعات العمل لهذا اليوم',
      'minutes' => 'دقيقة',
      'h' => 'سا',
      'm' => 'د',
      'hover_to_pick_time' => 'حدد المدة الزمنية بالضغط على الشريط الزمني',
      'time_consumed' => 'الوقت المستهلك',
      'update_on_task' => 'تحديث بخصوص المهمة',
     'add_update' => 'حفظ التحديث',
     'notes_of_progress' => 'مالجديد بخصوص هذه المهمة ؟',
      'try_again_later' => 'حاول تحديث الصفحة لاحقاً',
      'no_data_found' => 'لم يتم العثور على أي بيانات',
     'duration_required' => 'المدة المطلوبة لانجاز المهمة',

       'task_updates' => 'تحديثات المهمة',
      'add_new_update' => 'إضافة تحديث للمهمة',

      'progress' => 'التقدم',
      'duration' => 'المدة',
      'notes' => 'التحديث',
     'date' => 'التاريخ',
    'empty_time_error' => 'لا يمكن إضافة تحديث للمهمة بدون وقت',
    'empty_notes_error' => 'يجب أن تكتب شيئاً بخصوص هذا التحديث',
      'users' => 'المستخدمون',
      'tasks' => 'المهمات',
      'copy_rights_reserved' => 'حقوق النسخ محفوظة',
     'save_changes' => 'حفظ التغييرات',
     'designation' => 'المسمى الوظيفي',
     'saving' => 'جاري الحفظ',
              'select_department' => 'اختيار القسم',
    'saved' => 'تم الحفظ',
    'duration_not_set' => 'لم يتم تحديد الزمن',


       'todo_tasks' => 'مهام قيد الانتظار',
          'in_progress_tasks' => 'مهام قيد التنفيذ',
          'completed_tasks' => 'مهام منتهية',
          'task_description' => 'وصف المهمة',
          'task_file' => 'ملف المهمة',
          'upload_file' => 'رفع الملف',
          'download_file' => 'تحميل الملف المرفق',
          'no_file' => 'لم يتم إرفاق أي ملف',
          'no_option_selected' => 'لم يتم تحديد أي خيار',
          'eval_notes' => 'ملاحظات',


       'plz_contact_to_get_assigned' => ' قم بالتواصل مع الإدارة , حتى يتم تعيين منصب وظيفي لك في النظام',
          'welcome' => 'مرحبا بك',
          'presentation_html' => '<h3 class="mb-5 mt-4">  منصة إدارة المهام الفعالة   </h3>

  <p>في عالم الأعمال السريع والديناميكي الحالي، تعد إدارة المهام الفعالة أمرًا ضروريًا لإبقاء الفرق منظمة وتحقيق أهدافها. ولمعالجة هذه الحاجة، قامت   شركة رائدة في تطوير البرمجيات، بإنشاء منصة "أوكتوبوس"، وهي منصة قوية لإدارة المهام مصممة لتبسيط تكليف المهام وتتبعها ومراقبة التقدم.</p>

  <h4>الميزات الرئيسية لأوكتوبوس:</h4>
  <ol>
    <li>إنشاء وتكليف المهام: يمكنك إنشاء مهام جديدة بأوصاف مفصلة وإرفاقات وتواريخ استحقاق وأولويات. كما يمكنك تكليف المهام للمطورين الفرديين أو الفرق.</li>
    <li>تتبع التقدم: تحديثات فورية حول تقدم كل مهمة. يمكن للمطورين تحديث حالات المهام ووضع علامات على المهام كمكتملة وإضافة تعليقات أو ملاحظات.</li>
    <li>تتبع الوقت: ميزة تتبع الوقت المدمجة لتسجيل الوقت المستغرق في كل مهمة بدقة.</li>
    <li>التعاون والاتصال: قناة اتصال مركزية للتعاون المثالي بين أعضاء الفريق.</li>

  <li>التقارير والتحليلات: إمكانية إنشاء تقارير شاملة وتحليلات للحصول على رؤى قيمة حول أداء الفريق وتقدم المشروع بشكل عام.</li>
<li>التكامل والتخصيص: التكامل السلس مع أدوات إدارة المشاريع الأخرى ومنصات التعاون بين الفرق. كما يوفر المنصة خيارات للتخصيص لتتناسب مع سير العمل والتفضيلات الخاصة بك.</li>

  </ol>
  <p>تبرز أوكتوبوس،     كمنصة موثوقة وفعالة لإدارة المهام تهدف إلى تحسين تكليف المهام ومتابعة التقدم والتعاون لفرق تطوير البرمجيات. واجهتها البسيطة وميزاتها المتقدمة وقدرات التشغيل التلقائي تمكن مديري المشاريع من تبسيط عملياتهم وتعزيز إنتاجية الفريق وتحقيق نجاح المشروع.</p>

   <p>من خلال أوكتوبوس كحل إدارة المهام، يمكن للمؤسسات التعامل مع المشاريع المعقدة بثقة، والحفاظ على نظرة واضحة للمهام، وتعزيز العمل الجماعي الفعال نحو تحقيق أهدافها.</p>
  ',




];
